InformationRegisters/ОграничениеАссортимента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОграничениеАссортимента</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Comment>0-не введено, 1-введено, 2-РаспродажаСПоследующимВыводом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазовыйАссортимент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидАссортимента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАссортимента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТК_УчетнаяПолитикаТорговыхПлощадок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТК_УчетнаяПолитикаТорговыхПлощадок</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РезультатыПроверкиУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РезультатыПроверкиУчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УточнениеПроблемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВажностьПроблемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВажностьПроблемыУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выявлено</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИгнорироватьПроблему</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПроблемныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПроверкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПроверок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючУникальности</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИгнорироватьПроблему</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТК_СостояниеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТК_СостояниеДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСборкиРезервов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектыСоСтатусами</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ИзменениеАссортимента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИзменениеАссортимента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОграничениеАссортимента</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВводаВАссортимент</Name>
					<Comment>Дата ввода товар в ассортимент</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАссортимента</v8:Type>
						<v8:Type>cfg:DocumentRef.АссортиментныйКомитет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйАссортимент</Name>
							<Comment>Товар вводится в базовый ассортимет</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАссортимента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыАссортимента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТорговыеПлощадки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговаяПлощадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ТК_КассоваяСмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ТК_КассоваяСмена</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСменыККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаZотчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерZотчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВозврат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧеков</Name>
					<Comment>Количество чеков</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ТК_СтандартныеПодсистемы/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область УправлениеДоступом

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистемы УправлениеДоступом.

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовДоступа.
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	//
	//ВидДоступа = ВидыДоступа.Добавить();
	//ВидДоступа.Имя = "ГруппыФизическихЛиц";
	//ВидДоступа.Представление    = НСтр("ru='Группы физических лиц';uk='Групи фізичних осіб'");
	//ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.ФизическиеЛица");
	//ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаФизическихЛиц");

	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Организации";
	ВидДоступа.Представление    = НСтр("ru = 'Организации'; uk = 'Організації'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Организации");
		
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ПодразделенияКомпании";
	ВидДоступа.Представление    = НСтр("ru = 'Подразделения'; uk = 'Підрозділи'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.ПодразделенияКомпании");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ТорговыеПлощадки";
	ВидДоступа.Представление    = НСтр("ru = 'Объекты'; uk = 'Об''єкти'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.ТорговыеПлощадки");

	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ТипыЦен";
	ВидДоступа.Представление    = НСтр("ru = 'Типы цен'; uk = 'Типи цін'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.ТипыЦен");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Менеджеры";
	ВидДоступа.Представление    = НСтр("ru = 'Менеджеры'; uk = 'Менеджери'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.ФизическиеЛица");
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииИспользованияВидаДоступа.
Процедура ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	//
	//Если ВидДоступа = "ГруппыФизическихЛиц" Тогда
	//	Использование = Константы.ОграничиватьДоступПоФизическимЛицам.Получить();
	//КонецЕсли;
	
	Если ВидДоступа = "Организации"
		ИЛИ ВидДоступа = "ПодразделенияКомпании"
		ИЛИ ВидДоступа = "ТорговыеПлощадки" 
		ИЛИ ВидДоступа = "Менеджеры" Тогда
		
		Использование = Истина;
		
	ИначеЕсли ВидДоступа = "ТипыЦен" Тогда 
		
		Использование = Истина;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных.
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	// УправлениеДоступом
	Описание = Описание + "
	|Справочник.БанковскиеСчетаОрганизаций.Чтение.Организации
	|Справочник.БанковскиеСчетаОрганизаций.Изменение.Организации
	|Справочник.ДоговорыКонтрагентов.Чтение.Организации
	|Справочник.ДоговорыКонтрагентов.Чтение.ПодразделенияКомпании
	|Справочник.ДоговорыКонтрагентов.Изменение.Организации
	|Справочник.ДоговорыКонтрагентов.Изменение.ПодразделенияКомпании
	|Справочник.Карточки.Чтение.ТорговыеПлощадки
	|Справочник.Карточки.Изменение.ТорговыеПлощадки
	|Справочник.КассыККМ.Чтение.Организации
	|Справочник.КассыККМ.Чтение.ПодразделенияКомпании
	|Справочник.КассыККМ.Чтение.ТорговыеПлощадки
	|Справочник.КассыККМ.Изменение.Организации
	|Справочник.ТК_ГрафикиТСД.Чтение.ПодразделениеКомпании
	|Справочник.ТК_ГрафикиТСД.Изменение.ПодразделениеКомпании
	|Справочник.КассыККМ.Изменение.ПодразделенияКомпании
	|Справочник.КассыККМ.Изменение.ТорговыеПлощадки
	|Справочник.КассыКомпании.Чтение.Организации
	|Справочник.КассыКомпании.Чтение.ПодразделенияКомпании
	|Справочник.КассыКомпании.Чтение.ТорговыеПлощадки
	|Справочник.Организации.Чтение.Организации
	|Справочник.Организации.Изменение.Организации
	|Справочник.ПодразделенияКомпании.Чтение.ПодразделенияКомпании
	|Справочник.ПодразделенияКомпании.Изменение.ПодразделенияКомпании
	|Справочник.СкладыКомпании.Чтение.ПодразделенияКомпании
	|Справочник.СкладыКомпании.Чтение.ТорговыеПлощадки
	|Справочник.СкладыКомпании.Изменение.ПодразделенияКомпании
	|Справочник.СкладыКомпании.Изменение.ТорговыеПлощадки
	|Справочник.ТипыЦен.Чтение.ТипыЦен
	|Справочник.ТипыЦен.Изменение.ТипыЦен
	|Справочник.ТорговыеПлощадки.Чтение.ПодразделенияКомпании
	|Справочник.ТорговыеПлощадки.Чтение.ТорговыеПлощадки
	|Справочник.ТорговыеПлощадки.Изменение.ПодразделенияКомпании
	|Справочник.ТорговыеПлощадки.Изменение.ТорговыеПлощадки
	|Документ.ВозвратОтПокупателя.Чтение.Организации
	|Документ.ВозвратОтПокупателя.Чтение.ПодразделенияКомпании
	|Документ.ВозвратОтПокупателя.Чтение.ТорговыеПлощадки
	|Документ.ВозвратОтПокупателя.Изменение.Организации
	|Документ.ВозвратОтПокупателя.Изменение.ПодразделенияКомпании
	|Документ.ВозвратОтПокупателя.Изменение.ТорговыеПлощадки
	|Документ.ВозвратПоставщику.Чтение.Организации
	|Документ.ВозвратПоставщику.Чтение.ПодразделенияКомпании
	|Документ.ВозвратПоставщику.Чтение.ТорговыеПлощадки
	|Документ.ВозвратПоставщику.Изменение.Организации
	|Документ.ВозвратПоставщику.Изменение.ПодразделенияКомпании
	|Документ.ВозвратПоставщику.Изменение.ТорговыеПлощадки
	|Документ.ЗаказПокупателя.Чтение.Организации
	|Документ.ЗаказПокупателя.Чтение.ПодразделенияКомпании
	|Документ.ЗаказПокупателя.Чтение.ТорговыеПлощадки
	|Документ.ЗаказПокупателя.Изменение.Организации
	|Документ.ЗаказПокупателя.Изменение.ПодразделенияКомпании
	|Документ.ЗаказПокупателя.Изменение.ТорговыеПлощадки
	|Документ.ЗаказПоставщику.Чтение.Организации
	|Документ.ЗаказПоставщику.Чтение.ПодразделенияКомпании
	|Документ.ЗаказПоставщику.Чтение.ТорговыеПлощадки
	|Документ.ЗаказПоставщику.Изменение.Организации
	|Документ.ЗаказПоставщику.Изменение.ПодразделенияКомпании
	|Документ.ЗаказПоставщику.Изменение.ТорговыеПлощадки
	|Документ.ЗакрытиеСмены.Чтение.Организации
	|Документ.ЗакрытиеСмены.Чтение.ПодразделенияКомпании
	|Документ.ЗакрытиеСмены.Чтение.ТорговыеПлощадки
	|Документ.ЗакрытиеСмены.Изменение.Организации
	|Документ.ЗакрытиеСмены.Изменение.ПодразделенияКомпании
	|Документ.ЗакрытиеСмены.Изменение.ТорговыеПлощадки
	|Документ.ИзменениеАссортимента.Чтение.ПодразделенияКомпании
	|Документ.ИзменениеАссортимента.Изменение.ПодразделенияКомпании
	|Документ.ИзменениеПараметровСистемыЗаказов.Чтение.Организации
	|Документ.ИзменениеПараметровСистемыЗаказов.Чтение.ПодразделенияКомпании
	|Документ.ИзменениеПараметровСистемыЗаказов.Чтение.ТорговыеПлощадки
	|Документ.ИзменениеПараметровСистемыЗаказов.Изменение.Организации
	|Документ.ИзменениеПараметровСистемыЗаказов.Изменение.ПодразделенияКомпании
	|Документ.ИзменениеПараметровСистемыЗаказов.Изменение.ТорговыеПлощадки
	|Документ.ИзменениеЦен.Чтение.Организации
	|Документ.ИзменениеЦен.Чтение.ПодразделенияКомпании
	|Документ.ИзменениеЦен.Чтение.ТипыЦен
	|Документ.ИзменениеЦен.Изменение.Организации
	|Документ.ИзменениеЦен.Изменение.ПодразделенияКомпании
	|Документ.ИзменениеЦен.Изменение.ТипыЦен
	|Документ.Инвентаризация.Чтение.Организации
	|Документ.Инвентаризация.Чтение.ПодразделенияКомпании
	|Документ.Инвентаризация.Чтение.ТорговыеПлощадки
	|Документ.Инвентаризация.Изменение.Организации
	|Документ.Инвентаризация.Изменение.ПодразделенияКомпании
	|Документ.Инвентаризация.Изменение.ТорговыеПлощадки
	|Документ.ПеремещениеТоваров.Чтение.Организации
	|Документ.ПеремещениеТоваров.Чтение.ПодразделенияКомпании
	|Документ.ПересортицаТоваров.Чтение.Организации
	|Документ.ПересортицаТоваров.Чтение.ПодразделенияКомпании
	|Документ.ПересортицаТоваров.Чтение.ТорговыеПлощадки
	|Документ.ПересортицаТоваров.Изменение.Организации
	|Документ.ПересортицаТоваров.Изменение.ПодразделенияКомпании
	|Документ.ПересортицаТоваров.Изменение.ТорговыеПлощадки
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Чтение.Организации
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Чтение.ПодразделенияКомпании
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Чтение.ТорговыеПлощадки
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Изменение.Организации
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Изменение.ПодразделенияКомпании
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Изменение.ТорговыеПлощадки
	|Документ.ПоступлениеТоваров.Чтение.Организации
	|Документ.ПоступлениеТоваров.Чтение.ПодразделенияКомпании
	|Документ.ПоступлениеТоваров.Чтение.ТорговыеПлощадки
	|Документ.ПоступлениеТоваров.Изменение.Организации
	|Документ.ПоступлениеТоваров.Изменение.ПодразделенияКомпании
	|Документ.ПоступлениеТоваров.Изменение.ТорговыеПлощадки
	|Документ.ПриходныйКассовыйОрдер.Чтение.Организации
	|Документ.ПриходныйКассовыйОрдер.Чтение.ПодразделенияКомпании
	|Документ.ПриходныйКассовыйОрдер.Чтение.ТорговыеПлощадки
	|Документ.ПриходныйКассовыйОрдер.Изменение.Организации
	|Документ.ПриходныйКассовыйОрдер.Изменение.ПодразделенияКомпании
	|Документ.ПриходныйКассовыйОрдер.Изменение.ТорговыеПлощадки
	|Документ.ПротоколСогласованияЦен.Чтение.Организации
	|Документ.ПротоколСогласованияЦен.Чтение.ПодразделенияКомпании
	|Документ.ПротоколСогласованияЦен.Чтение.ТипыЦен
	|Документ.РасходныйКассовыйОрдер.Чтение.Организации
	|Документ.РасходныйКассовыйОрдер.Чтение.ПодразделенияКомпании
	|Документ.РасходныйКассовыйОрдер.Чтение.ТорговыеПлощадки
	|Документ.РасходныйКассовыйОрдер.Изменение.Организации
	|Документ.РасходныйКассовыйОрдер.Изменение.ПодразделенияКомпании
	|Документ.РасходныйКассовыйОрдер.Изменение.ТорговыеПлощадки
	|Документ.РеализацияТоваров.Чтение.Организации
	|Документ.РеализацияТоваров.Чтение.ПодразделенияКомпании
	|Документ.РеализацияТоваров.Чтение.ТорговыеПлощадки
	|Документ.РеализацияТоваров.Изменение.Организации
	|Документ.РеализацияТоваров.Изменение.ПодразделенияКомпании
	|Документ.РеализацияТоваров.Изменение.ТорговыеПлощадки
	|Документ.РезервированиеЗаказовПокупателя.Чтение.Организации
	|Документ.РезервированиеЗаказовПокупателя.Чтение.ПодразделенияКомпании
	|Документ.РезервированиеЗаказовПокупателя.Чтение.ТорговыеПлощадки
	|Документ.РезервированиеЗаказовПокупателя.Изменение.Организации
	|Документ.РезервированиеЗаказовПокупателя.Изменение.ПодразделенияКомпании
	|Документ.РезервированиеЗаказовПокупателя.Изменение.ТорговыеПлощадки
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.Организации
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.ПодразделенияКомпании
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.ТорговыеПлощадки
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.Организации
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.ПодразделенияКомпании
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.ТорговыеПлощадки
	|Документ.СписаниеТоваров.Чтение.Организации
	|Документ.СписаниеТоваров.Чтение.ПодразделенияКомпании
	|Документ.СписаниеТоваров.Чтение.ТорговыеПлощадки
	|Документ.СписаниеТоваров.Изменение.Организации
	|Документ.СписаниеТоваров.Изменение.ПодразделенияКомпании
	|Документ.СписаниеТоваров.Изменение.ТорговыеПлощадки
	|Документ.ТК_КассоваяСмена.Чтение.Организации
	|Документ.ТК_КассоваяСмена.Чтение.ПодразделенияКомпании
	|Документ.ТК_КассоваяСмена.Чтение.ТорговыеПлощадки
	|Документ.ТК_КассоваяСмена.Изменение.Организации
	|Документ.ТК_КассоваяСмена.Изменение.ПодразделенияКомпании
	|Документ.ТК_КассоваяСмена.Изменение.ТорговыеПлощадки
	|Документ.ЧекККМ.Чтение.Организации
	|Документ.ЧекККМ.Чтение.ПодразделенияКомпании
	|Документ.ЧекККМ.Чтение.ТорговыеПлощадки
	|Документ.ЧекККМ.Изменение.Организации
	|Документ.ЧекККМ.Изменение.ПодразделенияКомпании
	|Документ.ЧекККМ.Изменение.ТорговыеПлощадки
	|РегистрСведений.ОграничениеАссортимента.Чтение.ТорговыеПлощадки
	|РегистрСведений.ОграничениеАссортимента.Изменение.ТорговыеПлощадки
	|РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.Чтение.Организации
	|РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.Чтение.ТорговыеПлощадки
	|РегистрСведений.УчетнаяПолитикаОрганизаций.Чтение.Организации
	|РегистрСведений.УчетнаяПолитикаОрганизаций.Изменение.Организации
	|Документ.ВыпускПродукции.Чтение.Организации
	|Документ.ВыпускПродукции.Чтение.ПодразделенияКомпании
	|Документ.ВыпускПродукции.Чтение.ТорговыеПлощадки
	|Документ.ВыпускПродукции.Изменение.Организации
	|Документ.ВыпускПродукции.Изменение.ПодразделенияКомпании
	|Документ.ВыпускПродукции.Изменение.ТорговыеПлощадки
	|Документ.ПеремещениеТоваров.Изменение.Организации
	|Документ.ПеремещениеТоваров.Изменение.ПодразделенияКомпании
	|Документ.Рецептура.Чтение.ПодразделенияКомпании
	|Документ.Рецептура.Изменение.ПодразделенияКомпании
	|Документ.ТК_АктСверкиВзаиморасчетов.Чтение.Организации
	|Документ.ТК_АктСверкиВзаиморасчетов.Чтение.ПодразделенияКомпании
	|Документ.ТК_АктСверкиВзаиморасчетов.Изменение.Организации
	|Документ.ТК_АктСверкиВзаиморасчетов.Изменение.ПодразделенияКомпании
	|Документ.ТК_ТТН.Чтение.Организации
	|Документ.ТК_ТТН.Чтение.ПодразделенияКомпании
	|Документ.ТК_ТТН.Изменение.Организации
	|Документ.ТК_ТТН.Изменение.ПодразделенияКомпании
	|Документ.ТК_НалоговаяНакладная.Чтение.Организации
	|Документ.ТК_НалоговаяНакладная.Чтение.ПодразделенияКомпании
	|Документ.ТК_НалоговаяНакладная.Чтение.ТорговыеПлощадки
	|Документ.ТК_НалоговаяНакладная.Изменение.Организации
	|Документ.ТК_НалоговаяНакладная.Изменение.ПодразделенияКомпании
	|Документ.ТК_НалоговаяНакладная.Изменение.ТорговыеПлощадки
	|Документ.ТК_Приложение2КНалоговойНакладной.Чтение.Организации
	|Документ.ТК_Приложение2КНалоговойНакладной.Чтение.ПодразделенияКомпании
	|Документ.ТК_Приложение2КНалоговойНакладной.Чтение.ТорговыеПлощадки
	|Документ.ТК_Приложение2КНалоговойНакладной.Изменение.Организации
	|Документ.ТК_Приложение2КНалоговойНакладной.Изменение.ПодразделенияКомпании
	|Документ.ТК_Приложение2КНалоговойНакладной.Изменение.ТорговыеПлощадки
	|Документ.ТК_УстановкаКвотНаОтгрузку.Чтение.Организации
	|Документ.ТК_УстановкаКвотНаОтгрузку.Чтение.ПодразделенияКомпании
	|Документ.ТК_УстановкаКвотНаОтгрузку.Изменение.Организации
	|Документ.ТК_УстановкаКвотНаОтгрузку.Изменение.ПодразделенияКомпании
	|РегистрСведений.РезультатыПроверкиУчета.Чтение.ТорговаяПлощадка
	|";

КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	//Справочники
	//Списки.Вставить(Метаданные.Справочники.ГруппыДоступаФизическихЛиц, Истина);	
	Списки.Вставить(Метаданные.Справочники.Организации, Истина);
	Списки.Вставить(Метаданные.Справочники.ПодразделенияКомпании, Истина);
	Списки.Вставить(Метаданные.Справочники.ТорговыеПлощадки, Истина);
	Списки.Вставить(Метаданные.Справочники.СкладыКомпании, Истина);	
	Списки.Вставить(Метаданные.Справочники.БанковскиеСчетаОрганизаций, Истина);
	Списки.Вставить(Метаданные.Справочники.ДоговорыКонтрагентов, Истина);
	Списки.Вставить(Метаданные.Справочники.КассыККМ, Истина);	
	Списки.Вставить(Метаданные.Справочники.ЭквайринговыеТерминалы, Истина);
	Списки.Вставить(Метаданные.Справочники.Карточки, Истина);	
	Списки.Вставить(Метаданные.Справочники.КассыКомпании, Истина);
	Списки.Вставить(Метаданные.Справочники.ТипыЦен, Истина);
	Списки.Вставить(Метаданные.Справочники.ДоговорыКонтрагентовПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ТК_ГрафикиТСД, Истина);
	
	//Документы
	Списки.Вставить(Метаданные.Документы.ПоступлениеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратПоставщику, Истина);
	Списки.Вставить(Метаданные.Документы.РеализацияТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратОтПокупателя, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказПоставщику, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказПокупателя, Истина);
	Списки.Вставить(Метаданные.Документы.РезервированиеЗаказовПокупателя, Истина);	
	Списки.Вставить(Метаданные.Документы.ЗакрытиеСмены, Истина);
	Списки.Вставить(Метаданные.Документы.ИзменениеПараметровСистемыЗаказов, Истина);
	Списки.Вставить(Метаданные.Документы.ИзменениеЦен, Истина);
	Списки.Вставить(Метаданные.Документы.Инвентаризация, Истина);
	Списки.Вставить(Метаданные.Документы.ТК_КассоваяСмена, Истина);
	Списки.Вставить(Метаданные.Документы.ПересортицаТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ПриходныйКассовыйОрдер, Истина);
	Списки.Вставить(Метаданные.Документы.ПротоколСогласованияЦен, Истина);
	Списки.Вставить(Метаданные.Документы.РасходныйКассовыйОрдер, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ЧекККМ, Истина);
	Списки.Вставить(Метаданные.Документы.ПоступлениеБезналичныхДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеБезналичныхДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.ИзменениеАссортимента, Истина);
	Списки.Вставить(Метаданные.Документы.ПеремещениеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.Рецептура, Истина);
	Списки.Вставить(Метаданные.Документы.ВыпускПродукции, Истина);
	Списки.Вставить(Метаданные.Документы.ТК_ТТН, Истина);
	Списки.Вставить(Метаданные.Документы.ТК_АктСверкиВзаиморасчетов, Истина);
	Списки.Вставить(Метаданные.Документы.ТК_ГрафикЗаказов, Истина);
	Списки.Вставить(Метаданные.Документы.ТК_ОптимальноеКоличествоНоменклатуры, Истина);
	Списки.Вставить(Метаданные.Документы.ТК_НалоговаяНакладная, Истина);
	Списки.Вставить(Метаданные.Документы.ТК_Приложение2КНалоговойНакладной, Истина);
	Списки.Вставить(Метаданные.Документы.ТК_УстановкаКвотНаОтгрузку, Истина);
	Списки.Вставить(Метаданные.Документы.ТК_КорректировкаДолга, Истина);
	Списки.Вставить(Метаданные.Документы.ТК_Взаимозачет, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаЗаказаПокупателя, Истина);
	Списки.Вставить(Метаданные.Документы.АссортиментныйКомитет, Истина);
	Списки.Вставить(Метаданные.Документы.ТК_НазначениеСкидок, Истина);
	Списки.Вставить(Метаданные.Документы.ТК_ЗаявкаНаВозвратПоставщику, Истина);
	Списки.Вставить(Метаданные.Документы.ТК_ЗаявкаНаПеремещение, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаПартийТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.Задачи, Истина);
	Списки.Вставить(Метаданные.Документы.РасчетБонусов, Истина);
	Списки.Вставить(Метаданные.Документы.ТК_УстановкаМаркетинга, Истина);
	Списки.Вставить(Метаданные.Документы.ТК_Переработка, Истина);
	Списки.Вставить(Метаданные.Документы.ТК_ОприходованиеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.Анкета, Истина);
	Списки.Вставить(Метаданные.Документы.ТК_ГрафикИнвентаризаций, Истина);

	//Регистры сведений
	Списки.Вставить(Метаданные.РегистрыСведений.УчетнаяПолитикаОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.Цены, Истина);

	Списки.Вставить(Метаданные.РегистрыСведений.ОграничениеАссортимента, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ТК_ГрафикиЗаказов, Истина);

	Списки.Вставить(Метаданные.РегистрыСведений.ТК_УчетнаяПолитикаТорговыхПлощадок, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ТК_ПараметрыОбменаEDI, Ложь);	
	Списки.Вставить(Метаданные.РегистрыСведений.ПараметрыСистемыЗаказов, Ложь);
	Списки.Вставить(Метаданные.РегистрыСведений.СогласованиеЦен, Ложь);
	Списки.Вставить(Метаданные.РегистрыСведений.СогласованиеЦенАкция, Ложь);
	Списки.Вставить(Метаданные.РегистрыСведений.ТК_ТБД_ИтогиСканирования, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ТК_ПосетителиТорговыхТочек, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ТК_ТНП_ИтогиСканирования, Истина);

	
	// Переопределение ограничения списков подсистемы КонтрольВеденияУчета.
	Списки.Вставить(Метаданные.РегистрыСведений.РезультатыПроверкиУчета, Ложь);

	
	
	
	//Регистры накопления
	Списки.Вставить(Метаданные.РегистрыНакопления.ОстаткиТоваровКомпании, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровКомпании, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.Продажи, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСПоставщиками, Истина);	
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоДокументам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСПокупателями, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСПокупателямиПоДокументам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПриходованиеТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыПоставщикам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыПокупателей, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РезервыТоваров, Истина);	
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваВКассахККМ, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваКомпании, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.Производство, Ложь);
	Списки.Вставить(Метаданные.РегистрыНакопления.РозничныеПродажиПодакцизныхТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ОстаткиТоваровТМП, Истина);

	
	//Журналы документов
	Списки.Вставить(Метаданные.ЖурналыДокументов.ТК_ЗаказыПокупателей, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.КассовыеОрдера, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ТК_СервисДеск, Истина);

	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	// Профиль "Базовая группа".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "5598f9fe-ba9d-11ea-a201-005056bf7242";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Базовая группа'; uk = 'Базова група'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предоставляет право открытия программы и чтение основной нормативно-справочной информации.
              |'; uk = 'Надає право відкриття програми та читання основної нормативно-довідкової інформації'");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ТК_БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("ТК_ЧтениеНСИ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ПодразделенияКомпании");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ТорговыеПлощадки");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ТипыЦен");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Операторы Аттика".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "e2acaae8-5d27-11ea-a222-005056bf05ac";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Операторы Аттика'; uk = 'Оператори Аттіка'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Основная роль операторов аттики'; uk = 'Головна роль операторів Аттики'");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ТК_ДобавлениеИзменениеДокументовПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ТК_ДобавлениеИзменениеДокументовПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ТК_ДобавлениеИзменениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ТК_ИспользваниеОбработкиОбменОпенСтор");
	ОписаниеПрофиля.Роли.Добавить("ТК_ИспользваниеОтчетаВзаиморасчетыСПокупателями");
	ОписаниеПрофиля.Роли.Добавить("ТК_ИспользваниеОтчетаВзаиморасчетыСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ТК_ИспользваниеОтчетаОстаткиОборотыПартий");
	ОписаниеПрофиля.Роли.Добавить("ТК_ИспользваниеОтчетаОстаткиОборотыТоваров");
	ОписаниеПрофиля.Роли.Добавить("ТК_ИспользваниеОтчетаПродажи");
	ОписаниеПрофиля.Роли.Добавить("ТК_ЧтениеДокументовПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ТК_ЧтениеДокументовПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ТК_ЧтениеЗаказовПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ТК_ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ТК_ЧтениеИнвентаризаций");
	ОписаниеПрофиля.Роли.Добавить("ТК_ЧтениеПараметровСистемыЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ТК_ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ТК_ЧтениеПротоколовСогласованияЦен");
	ОписаниеПрофиля.Роли.Добавить("ТК_ЧтениеСписанияТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ПодразделенияКомпании");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ТорговыеПлощадки");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ТипыЦен");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);	
	

	// Профиль "Операторы Аттика (Расширенные права)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "214443a5-bb6e-11ea-a201-005056bf7242";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Операторы Аттика (Расширенные права)'; uk = 'Оператори Аттіка (Розширені права)'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Расширенный профиль для руководителя операторов Аттики'; uk = 'Розширений профіль для керівників операторів Аттіки'");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	ОписаниеПрофиля.Роли.Добавить("ТК_ДобавлениеИзменениеДокументовПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ТК_ДобавлениеИзменениеДокументовПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ТК_ДобавлениеИзменениеИнвентаризаций");
	ОписаниеПрофиля.Роли.Добавить("ТК_ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ТК_ДобавлениеИзменениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ТК_ДобавлениеИзменениеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ТК_ДобавлениеИзменениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ТК_ДобавлениеИзменениеПересортицТоваров");
	ОписаниеПрофиля.Роли.Добавить("ТК_ДобавлениеИзменениеПодразделений");
	ОписаниеПрофиля.Роли.Добавить("ТК_ДобавлениеИзменениеСкладовКомпании");
	ОписаниеПрофиля.Роли.Добавить("ТК_ДобавлениеИзменениеТорговыхПлощадок");
	ОписаниеПрофиля.Роли.Добавить("ТК_ИспользваниеОбработкиЗагрузкаДокументовПоWebСервису");
	ОписаниеПрофиля.Роли.Добавить("ТК_ИспользваниеОтчетаНаценкиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ТК_ЧтениеДокументовБанка");
	ОписаниеПрофиля.Роли.Добавить("ТК_ЧтениеДокументовКассы");
	ОписаниеПрофиля.Роли.Добавить("ТК_ЧтениеИнвентаризаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииОВерсияхОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ПодразделенияКомпании");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ТорговыеПлощадки");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ТипыЦен");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Запуск Веб-Клиента".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "0b956997-bb6c-11ea-a201-005056bf7242";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Запуск Веб-Клиента'; uk = 'Запуск Веб-Клієнту'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предоставляет право открытия программы в Веб-Клиенте.
              |Состав ролей профиля не рекомендуется изменять.'; uk = 'Надає право відкриття програми у Веб-Клієнті.
              |Склад ролей профілю не рекомендується змінювати'");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);


	// Профиль "Использование дополнительных отчетов и обработок".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "f88f7b88-bb6b-11ea-a201-005056bf7242";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Использование дополнительных отчетов и обработок'; uk = 'Використання додаткових звітів та обробок'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предоставляет право открытия дополнительных отчетов и обработок и, при необходимости, ограничивает их состав.
              |Состав ролей профиля не рекомендуется изменять.'; uk = 'Надає право відкриття додаткових звітів та обробок та, при необхідності, обмежує їхній склад.
              |Склад ролей профілю не рекомендується змінювати'");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ДополнительныеОтчетыИОбработки");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);


	// Профиль "Установка дат запрета изменения".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "67314edc-bb6e-11ea-a201-005056bf7242";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Установка дат запрета изменения'; uk = 'Встановлення дат заборони змін'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предоставляет право установки дат запрета изменения данных.
              |Состав ролей профиля не рекомендуется изменять.'; uk = 'Надає право встановлення дат заборони зміни даних.
              |Склад ролей профілю не рекомендується змінювати'");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДатЗапретаИзменения");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);	
	
КонецПроцедуры


#КонецОбласти

#Область ДатыЗапретаИзменения

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистемы ДатыЗапретаИзменения.

// См. ДатыЗапретаИзмененияПереопределяемый.ПриЗаполненииРазделовДатЗапретаИзменения.
Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт
	
	Раздел = Разделы.Добавить();
	Раздел.Имя  = "СкладскиеДокументы";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("6e8d4294-8c0f-4f0d-a0ae-38deb03e84cb");
	Раздел.Представление = НСтр("ru = 'Складские документы'; uk = 'Складські документи'");
	
	Раздел = Разделы.Добавить();
	Раздел.Имя  = "ДокументыПоставщиков";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("6e8d4294-8c0f-4f0d-a0ae-38deb03e85cb");
	Раздел.Представление = НСтр("ru = 'Документы поставщиков'; uk = 'Документи постачальників'");
	
	Раздел = Разделы.Добавить();
	Раздел.Имя  = "ДокументыПокупателей";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("6e8d4294-8c0f-4f0d-a0ae-38deb03e86cb");
	Раздел.Представление = НСтр("ru = 'Документы покупателей'; uk = 'Документи покупців'");	
	
	Раздел = Разделы.Добавить();
	Раздел.Имя  = "ДокументыДляНалоговой";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("6e8d4294-8c0f-3f1d-a0ae-66deb04e87cb");
	Раздел.Представление = НСтр("ru = 'Документы для налоговой'; uk = 'Документи для податкової'");		
	
	Раздел = Разделы.Добавить();
	Раздел.Имя  = "ДокументыИзмененияЦен";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("6e8d4294-8c0f-4f0d-a0ae-38deb03e87cb");
	Раздел.Представление = НСтр("ru = 'Документы изменения цен'; uk = 'Документи зміни цін'");
	
	Раздел = Разделы.Добавить();
	Раздел.Имя  = "ДвиженияДенежныхСредств";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("6e8d4294-8c0f-4f0d-a0ae-38deb03e88cb");
	Раздел.Представление = НСтр("ru = 'Движения денежных средств'; uk = 'Рух грошових коштів'");	
	
	Раздел = Разделы.Добавить();
	Раздел.Имя = "НастройкиСистемыЗаказов";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("6e8d4294-8c1f-5f1d-a0ae-39deb03e18db");
	Раздел.Представление = НСтр("ru = 'Настройки системы заказов'; uk = 'Налаштування системи замовлень'");	
	
	Раздел = Разделы.Добавить();
	Раздел.Имя = "ДокументыПроизводство";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("6e8d4294-8c1f-5f1d-a0ae-40deb04e19db");
	Раздел.Представление = НСтр("ru = 'Документы производства'; uk = 'Документи виробництва'");	
	
	Раздел = Разделы.Добавить();
	Раздел.Имя = "ДокументыТТН";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("82fae886-708f-4256-91d4-8b19d4ae4f25");
	Раздел.Представление = НСтр("ru = 'Документ ТТН'; uk = 'Документ ТТН'");	

	
КонецПроцедуры

// См. ДатыЗапретаИзмененияПереопределяемый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.Инвентаризация.ПолноеИмя(),
		"Дата", "СкладскиеДокументы");
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.ПеремещениеТоваров.ПолноеИмя(),
		"Дата", "СкладскиеДокументы");
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.ПересортицаТоваров.ПолноеИмя(),
		"Дата", "СкладскиеДокументы");
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.СписаниеТоваров.ПолноеИмя(),
		"Дата", "СкладскиеДокументы");
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
		Метаданные.Документы.ТК_ОприходованиеТоваров.ПолноеИмя(),
		"Дата", "СкладскиеДокументы");
		
		
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.ВозвратПоставщику.ПолноеИмя(),
		"Дата", "ДокументыПоставщиков");
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.ПоступлениеТоваров.ПолноеИмя(),
		"Дата", "ДокументыПоставщиков");

	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.ЗаказПоставщику.ПолноеИмя(),
		"Дата", "ДокументыПоставщиков");
		
		
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.ВозвратОтПокупателя.ПолноеИмя(),
		"Дата", "ДокументыПокупателей");
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.ВозвратОтПокупателя.ПолноеИмя(),
		"Дата", "ДокументыПокупателей");
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.ЗакрытиеСмены.ПолноеИмя(),
		"Дата", "ДокументыПокупателей");
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.РеализацияТоваров.ПолноеИмя(),
		"Дата", "ДокументыПокупателей");
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.ЧекККМ.ПолноеИмя(),
		"Дата", "ДокументыПокупателей");
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.ЗаказПокупателя.ПолноеИмя(),
		"Дата", "ДокументыПокупателей");
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.РезервированиеЗаказовПокупателя.ПолноеИмя(),
		"Дата", "ДокументыПокупателей");
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.ТК_ТТН.ПолноеИмя(),
		"Дата", "ДокументыТТН");
				
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
		Метаданные.Документы.ТК_УстановкаКвотНаОтгрузку.ПолноеИмя(),
		"Дата", "ДокументыТТН");
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
		Метаданные.Документы.КорректировкаЗаказаПокупателя.ПолноеИмя(),
		"Дата", "ДокументыПокупателей");				
		
		
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.ТК_НалоговаяНакладная.ПолноеИмя(),
		"Дата", "ДокументыДляНалоговой");
				
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.ТК_Приложение2КНалоговойНакладной.ПолноеИмя(),
		"Дата", "ДокументыДляНалоговой");
		
		
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.ИзменениеЦен.ПолноеИмя(),
		"Дата", "ДокументыИзмененияЦен");
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.ПротоколСогласованияЦен.ПолноеИмя(),
		"Дата", "ДокументыИзмененияЦен");					
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.ТК_НазначениеСкидок.ПолноеИмя(),
		"Дата", "ДокументыИзмененияЦен");					
		
		
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.ПриходныйКассовыйОрдер.ПолноеИмя(),
		"Дата", "ДвиженияДенежныхСредств");			
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.РасходныйКассовыйОрдер.ПолноеИмя(),
		"Дата", "ДвиженияДенежныхСредств");			
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.ПоступлениеБезналичныхДенежныхСредств.ПолноеИмя(),
		"Дата", "ДвиженияДенежныхСредств");			
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		Метаданные.Документы.СписаниеБезналичныхДенежныхСредств.ПолноеИмя(),
		"Дата", "ДвиженияДенежныхСредств");			
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
		Метаданные.Документы.ТК_АктСверкиВзаиморасчетов.ПолноеИмя(),
		"Дата", "ДвиженияДенежныхСредств");
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
		Метаданные.Документы.ТК_КорректировкаДолга.ПолноеИмя(),
		"Дата", "ДвиженияДенежныхСредств");
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
		Метаданные.Документы.ТК_Взаимозачет.ПолноеИмя(),
		"Дата", "ДвиженияДенежныхСредств");
		
				
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
		Метаданные.Документы.ТК_ОптимальноеКоличествоНоменклатуры.ПолноеИмя(),
		"Дата", "НастройкиСистемыЗаказов");
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
		Метаданные.Документы.ТК_ГрафикЗаказов.ПолноеИмя(),
		"Дата", "НастройкиСистемыЗаказов");
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
		Метаданные.Документы.ИзменениеАссортимента.ПолноеИмя(),
		"Дата", "НастройкиСистемыЗаказов");
		
		
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
		Метаданные.Документы.ВыпускПродукции.ПолноеИмя(),
		"Дата", "ДокументыПроизводство");
		
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
	//	Метаданные.Документы.Рецептура.ПолноеИмя(),
	//	"Дата", "ДокументыПроизводство");
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
		Метаданные.Документы.ТК_Переработка.ПолноеИмя(),
		"Дата", "ДокументыПроизводство");

		
КонецПроцедуры

// См. ДатыЗапретаИзмененияПереопределяемый.ПередПроверкойЗапретаИзменения
Процедура ПередПроверкойЗапретаИзменения(Объект,
                                         ПроверкаЗапретаИзменения,
                                         УзелПроверкиЗапретаЗагрузки,
                                         ВерсияОбъекта) Экспорт
	
	
	
КонецПроцедуры

// См. ДатыЗапретаИзмененияПереопределяемый.ПередПроверкойСтаройВерсииДанных
Процедура ПередПроверкойСтаройВерсииДанных(ОбъектМетаданных, ИдентификаторДанных, УзелПроверкиЗапретаЗагрузки, ДанныеДляПроверки) Экспорт
	
КонецПроцедуры

// См. ДатыЗапретаИзмененияПереопределяемый.ПередПроверкойНовойВерсииДанных
Процедура ПередПроверкойНовойВерсииДанных(ОбъектМетаданных, Данные, УзелПроверкиЗапретаЗагрузки, ДанныеДляПроверки) Экспорт
	
КонецПроцедуры



#КонецОбласти


#Область ПроверкаОтказовРЦ

Процедура ПроверитьОтказыРекламацииРЦ(Проверка, ПараметрыПроверки)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТК_СостояниеДокументов.СсылкаНаОбъект КАК СсылкаНаОбъект,
	|	ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров).ТорговаяПлощадка КАК ТорговаяПлощадка
	|ИЗ
	|	РегистрСведений.ТК_СостояниеДокументов КАК ТК_СостояниеДокументов
	|ГДЕ
	|	ТК_СостояниеДокументов.СсылкаНаОбъект ССЫЛКА Документ.ПеремещениеТоваров
	|	И ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров).ХозОперация = ЗНАЧЕНИЕ(Справочник.Хозоперации.ПеремещениеТоваровВФилиал)
	|	И ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров).ПометкаУдаления = ЛОЖЬ";
	
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		Проблема = КонтрольВеденияУчета.ОписаниеПроблемы(Результат.СсылкаНаОбъект, ПараметрыПроверки);
		
		Проблема.УточнениеПроблемы = НСтр("ru = 'Отказ РЦ'");
		Проблема.Вставить("ТорговаяПлощадка", Результат.ТорговаяПлощадка);
		
		КонтрольВеденияУчета.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
	
	


#КонецОбласти
